define e = Character('Эйлин', color="#c8ffc8")

# Вместо использования оператора image можете просто
# складывать все ваши файлы изображений в папку images.
# Например, сцену bg room можно вызвать файлом "bg room.png",
# а eileen happy — "eileen happy.webp", и тогда они появятся в игре.

# Игра начинается здесь:
label start:

    scene window blinds
    # play music "hotel.ogg"

    play sound "sunny day in mexico.wav"

    "Солнце пробивалось сквозь щель между занавеской и стеной." 
    
    "Хотя в номере и работал кондиционер, выставленный на 24 градуса, предчувствие действительного жаркого дня не покидало меня."

    "Воздух еще оставался прохладным и пригодным для дыхания, но стоило выйти наружу, и можно было ощутить себя в финской сауне."

    scene hotel room

    "Я открыл глаза, пытаясь пробрать сквозь дрёму, вынырнуть из густоты сна. "

    "Иногда кажется что граница между сном и действительностью открыта, а иногда пробраться сквозь нее стоит огромных усилий."

    "В этот раз был второй случай."

    "Черт, я ничего не помню."

    "Вчерашная память была мутной и расплывчатой. Всему виной лечение текиллой, и повышенная температура."

    "И да, я забыл сказать что температура влияет на меня странно, очень странно."

    "Я могу начинать видеть то, чего нет, или есть, на другой стороне реальности."

    scene tequila bottle

    "Я не хочу сильно думать об этом, и текилла мне помогает в этом."

    "Раз уж речь зашла о текилле."

    "Она приветливая, как добрый друг, но иногда у нее плохое настроение и следующий день привносит немного боли в существование."

    "Я открыл занавески и подошел к столу. На нем была фиолетовая тетрадь и несколько листов А4. и початая бутылка текилы."

    "Черт, я ничего не помню."

    "В тетради оставляю план на следущие дни, как раз для таких случаев."

    "Надо загрузиться, как загружается телефон после обновления, приняв душ."

    "В тетради был план на сегодня: посетить CPS-18, и узнать как дела у Олега."
    
    "Кто такой Олег?"

    "Хм... Кажется память медленно возвращается, кусочками."

    scene shower

    play sound "taking shower.wav"

    "Я пошел в душ."

    "Помещение душа, в этом номере огромное, как сама комната."

    "В Мексике проблемы с теплой водой, но это не холодная страна."

    "Боилеры включают по мере надобности, и утром вода еще прохладная. В самый раз."

    "Я стал пробирать сквозь воспоминания, острожно обходя ложные."

    scene schizo dreams

    "Я забыл сказать, я обладаю особым даром: шизофренией."

    "от жары я теряю нить повествования, проваливая в фантасмогрию, которая состоит преимещственно из содержания ютюб роликов и песен, которые слышал."

    "Обычно это происходит от какого-нибудь триггера, звука или символа, но тут в Мексике главный триггер это жара."

    "Чем жарче, тем безумнее становится то что я вижу или слышу."

    "Олег - блоггер, который который записывал странные ролики на YouTube, а потом пропал."

    "Я увлекался его роликами, и стал исследовать то, что он пытался донести до публики."

    "Мои исследования завели меня в странный угол Интернета, где люди считали что на планете идет война между силами зла, который завладевали телами бабушек, а противостояла им организация ООН."

    "Я пытался пробраться через завесу тайны, но она никак не хотела растворяться перед моим натиском."

    "Три месяца назад я нашел странную записку у своей двери, в которой был адрес, адрес мексиканской тюрьмы CPS-18 и имя."

    "Олег."

    "Я написал туда письмо, оставив свой адрес телефона, и спустя какое-то время Олег позвонил мне."

    "Я принял решение приехать туда, потому что тайна не давала мне думать, захватывая мое сознание все больше и больше."

    scene shower

    play sound "taking shower.wav"

    "В душе закончилась вода и последние капли упали мне на макушку."

    scene hotel room

    "Сегодня я должен посетить Олега, попав в CPS-18, которая суда по информации из интернета была особо охраняемой крепостью."

    return
